In [1]:
import pandas as pd

In [2]:
df=pd.read_csv(r"E:\HJ Data Analyst\Project\Customer Behavior Analysis\Raw data\customer_shopping_behavior.csv")

#When you put r before the string: 
# You are telling Python:

# Treat everything inside this string exactly as written, don’t interpret \ as special.

# That is why it is called a raw string.

In [3]:
df.head()

# top 5 rows

,Customer ID,Age,Gender,Item Purchased,Category,Purchase Amount (USD),Location,Size,Color,Season,Review Rating,Subscription Status,Shipping Type,Discount Applied,Promo Code Used,Previous Purchases,Payment Method,Frequency of Purchases
0,1,55,Male,Blouse,Clothing,53,Kentucky,L,Gray,Winter,3.1,Yes,Express,Yes,Yes,14,Venmo,Fortnightly
1,2,19,Male,Sweater,Clothing,64,Maine,L,Maroon,Winter,3.1,Yes,Express,Yes,Yes,2,Cash,Fortnightly
2,3,50,Male,Jeans,Clothing,73,Massachusetts,S,Maroon,Spring,3.1,Yes,Free Shipping,Yes,Yes,23,Credit Card,Weekly
3,4,21,Male,Sandals,Footwear,90,Rhode Island,M,Maroon,Spring,3.5,Yes,Next Day Air,Yes,Yes,49,PayPal,Weekly
4,5,45,Male,Blouse,Clothing,49,Oregon,M,Turquoise,Spring,2.7,Yes,Free Shipping,Yes,Yes,31,PayPal,Annually

In [4]:
df.tail()

# last 5 rows

,Customer ID,Age,Gender,Item Purchased,Category,Purchase Amount (USD),Location,Size,Color,Season,Review Rating,Subscription Status,Shipping Type,Discount Applied,Promo Code Used,Previous Purchases,Payment Method,Frequency of Purchases
3895,3896,40,Female,Hoodie,Clothing,28,Virginia,L,Turquoise,Summer,4.2,No,2-Day Shipping,No,No,32,Venmo,Weekly
3896,3897,52,Female,Backpack,Accessories,49,Iowa,L,White,Spring,4.5,No,Store Pickup,No,No,41,Bank Transfer,Bi-Weekly
3897,3898,46,Female,Belt,Accessories,33,New Jersey,L,Green,Spring,2.9,No,Standard,No,No,24,Venmo,Quarterly
3898,3899,44,Female,Shoes,Footwear,77,Minnesota,S,Brown,Summer,3.8,No,Express,No,No,24,Venmo,Weekly
3899,3900,52,Female,Handbag,Accessories,81,California,M,Beige,Spring,3.1,No,Store Pickup,No,No,33,Venmo,Quarterly

In [5]:
df.info()

# This tells:

# Number of rows

# Number of columns

# Data types

# Missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3900 entries, 0 to 3899
Data columns (total 18 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Customer ID             3900 non-null   int64
 1   Age                     3900 non-null   int64
 2   Gender                  3900 non-null   object
 3   Item Purchased          3900 non-null   object
 4   Category                3900 non-null   object
 5   Purchase Amount (USD)   3900 non-null   int64
 6   Location                3900 non-null   object
 7   Size                    3900 non-null   object
 8   Color                   3900 non-null   object
 9   Season                  3900 non-null   object
 10  Review Rating           3863 non-null   float64
 11  Subscription Status     3900 non-null   object
 12  Shipping Type           3900 non-null   object
 13  Discount Applied        3900 non-null   object
 14  Promo Code Used         3900 non-null   object
 15  Previous Purchases      3900 non-null   int64
 16  Payment Method          3900 non-null   object
 17  Frequency of Purchases  3900 non-null   object
dtypes: float64(1), int64(4), object(13)
memory usage: 548.6+ KB

In [6]:
df.isnull().sum()

# tells you how many missing values are there in each column of your DataFrame.

Customer ID                0
Age                        0
Gender                     0
Item Purchased             0
Category                   0
Purchase Amount (USD)      0
Location                   0
Size                       0
Color                      0
Season                     0
Review Rating             37
Subscription Status        0
Shipping Type              0
Discount Applied           0
Promo Code Used            0
Previous Purchases         0
Payment Method             0
Frequency of Purchases     0
dtype: int64

In [7]:
df.describe(include='all')

# It gives you a complete summary of all columns in your dataframe — both numeric and non-numeric.

,Customer ID,Age,Gender,Item Purchased,Category,Purchase Amount (USD),Location,Size,Color,Season,Review Rating,Subscription Status,Shipping Type,Discount Applied,Promo Code Used,Previous Purchases,Payment Method,Frequency of Purchases
count,3900.000000,3900.000000,3900,3900,3900,3900.000000,3900,3900,3900,3900,3863.000000,3900,3900,3900,3900,3900.000000,3900,3900
unique,NaN,NaN,2,25,4,NaN,50,4,25,4,NaN,2,6,2,2,NaN,6,7
top,NaN,NaN,Male,Blouse,Clothing,NaN,Montana,M,Olive,Spring,NaN,No,Free Shipping,No,No,NaN,PayPal,Every 3 Months
freq,NaN,NaN,2652,171,1737,NaN,96,1755,177,999,NaN,2847,675,2223,2223,NaN,677,584
mean,1950.500000,44.068462,NaN,NaN,NaN,59.764359,NaN,NaN,NaN,NaN,3.750065,NaN,NaN,NaN,NaN,25.351538,NaN,NaN
std,1125.977353,15.207589,NaN,NaN,NaN,23.685392,NaN,NaN,NaN,NaN,0.716983,NaN,NaN,NaN,NaN,14.447125,NaN,NaN
min,1.000000,18.000000,NaN,NaN,NaN,20.000000,NaN,NaN,NaN,NaN,2.500000,NaN,NaN,NaN,NaN,1.000000,NaN,NaN
25%,975.750000,31.000000,NaN,NaN,NaN,39.000000,NaN,NaN,NaN,NaN,3.100000,NaN,NaN,NaN,NaN,13.000000,NaN,NaN
50%,1950.500000,44.000000,NaN,NaN,NaN,60.000000,NaN,NaN,NaN,NaN,3.800000,NaN,NaN,NaN,NaN,25.000000,NaN,NaN
75%,2925.250000,57.000000,NaN,NaN,NaN,81.000000,NaN,NaN,NaN,NaN,4.400000,NaN,NaN,NaN,NaN,38.000000,NaN,NaN
max,3900.000000,70.000000,NaN,NaN,NaN,100.000000,NaN,NaN,NaN,NaN,5.000000,NaN,NaN,NaN,NaN,50.000000,NaN,NaN

In [8]:
df['Review Rating'] = df.groupby('Category')['Review Rating'].transform(lambda x: x.fillna(x.median()))

# For each Category, fill missing Review Ratings with that Category’s median rating.

In [9]:
df.isnull().sum()

Customer ID               0
Age                       0
Gender                    0
Item Purchased            0
Category                  0
Purchase Amount (USD)     0
Location                  0
Size                      0
Color                     0
Season                    0
Review Rating             0
Subscription Status       0
Shipping Type             0
Discount Applied          0
Promo Code Used           0
Previous Purchases        0
Payment Method            0
Frequency of Purchases    0
dtype: int64

In [10]:
df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(' ','_')
df = df.rename(columns = {'purchase_amount_(usd)':'purchase_amount'})

# First line: Convert all column names to lowercase
# Second line: Replace spaces with underscore
# Third line : changing the column name from purchase_amount_(usd) to purchase_amount.

# Why we do this (Best Practice)

# This is called column name normalization, and it is almost always done at the start of a project because it:

# Avoids errors

# Makes code cleaner

# Makes teamwork easier

# Makes your project look professional

In [11]:
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'promo_code_used', 'previous_purchases',
       'payment_method', 'frequency_of_purchases'],
      dtype='object')

In [12]:
# create a column age_group

labels = ['Young Adult', 'Adult', 'Middle-aged', 'Senior']
df['age_group'] = pd.qcut(df['age'], q=4, labels=labels)

# This code is used to create a new categorical column called 'age_group' based on the existing 'age' column in the dataframe. 
# First, a list of labels — 'Young Adult', 'Adult', 'Middle-aged', and 'Senior' — is defined to represent four meaningful age categories. 
# These labels will later be assigned to different segments of the age data. Then, the pandas function pd.qcut() is applied to the 'age' column
# with the parameter q=4, which divides the age values into four equal-sized groups based on their statistical distribution (quartiles), 
# ensuring that each group contains approximately 25% of the total observations. Instead of returning numerical age ranges, the function assigns 
# the predefined category labels to each group, making the results more interpretable and useful for analysis. The final categorized values are 
# stored in a newly created column named 'age_group' in the dataframe for further exploratory and business analysis.

In [13]:
df[['age','age_group']].head(10)

# This line of code is used to display a subset of the dataframe for verification and better understanding of the newly
# created 'age_group' column. By selecting df[['age','age_group']], we are explicitly extracting only the two relevant columns — 
# the original numerical 'age' column and the newly created categorical 'age_group' column — instead of viewing the entire dataframe. 
# The .head(10) function then returns the first 10 rows of these selected columns, allowing us to quickly inspect and confirm whether 
# the age values have been correctly categorized into their respective age groups without scrolling through the full dataset.

   age    age_group
0   55  Middle-aged
1   19  Young Adult
2   50  Middle-aged
3   21  Young Adult
4   45  Middle-aged
5   46  Middle-aged
6   63       Senior
7   27  Young Adult
8   26  Young Adult
9   57  Middle-aged

In [14]:
#Create column purchase_frequency_days

frequency_mapping = {
    'Fortnightly':14,
    'Weekly':7,
    'Monthly':30,
    'Quarterly':90,
    'Bi-Weekly':14,
    'Annually':365,
    'Every 3 Months':90
}
df['purchase_frequency_days'] = df['frequency_of_purchases'].map(frequency_mapping)

#This code converts the categorical purchase frequency information into numerical values representing days. 
# First, a dictionary named frequency_mapping is created, where each textual purchase frequency category 
# (such as 'Weekly', 'Monthly', 'Quarterly', etc.) is assigned a corresponding number of days 
# (for example, 'Weekly' is mapped to 7 days and 'Monthly' to 30 days). This dictionary acts as a reference lookup table for conversion. 
# Then, the .map() function is applied to the 'frequency_of_purchases' column, which replaces each category with its mapped numerical 
# value from the dictionary. The converted values are stored in a new column called 'purchase_frequency_days', making the data suitable 
# for quantitative analysis, calculations, and further modeling.

In [15]:
df[['purchase_frequency_days','frequency_of_purchases']].head(10)

#Show me the first 10 rows of the two columns: original purchase frequency and the new converted purchase frequency in days.
#We use double brackets [[ ]] because we are selecting more than one column.

   purchase_frequency_days frequency_of_purchases
0                       14            Fortnightly
1                       14            Fortnightly
2                        7                 Weekly
3                        7                 Weekly
4                      365               Annually
5                        7                 Weekly
6                       90              Quarterly
7                        7                 Weekly
8                      365               Annually
9                       90              Quarterly

In [16]:
df[['discount_applied','promo_code_used']].head(10)

#From my entire dataframe (df), show me ONLY these two columns and it's first 10 rows

  discount_applied promo_code_used
0              Yes             Yes
1              Yes             Yes
2              Yes             Yes
3              Yes             Yes
4              Yes             Yes
5              Yes             Yes
6              Yes             Yes
7              Yes             Yes
8              Yes             Yes
9              Yes             Yes

In [17]:
(df['discount_applied']==df['promo_code_used']).all()

#Check whether the columns discount_applied and promo_code_used have exactly the same values in every single row.

np.True_

In [18]:
df=df.drop('promo_code_used',axis=1)

#Remove the column promo_code_used from the dataframe.
#axis value	Meaning
# axis=0	Row
# axis=1	Column

In [19]:
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'previous_purchases', 'payment_method',
       'frequency_of_purchases', 'age_group', 'purchase_frequency_days'],
      dtype='object')

In [20]:
!pip install psycopg2-binary
!pip install sqlalchemy


# What is psycopg2-binary?

# This is a PostgreSQL connector for Python.

# In simple words:
# 👉 It is the bridge that lets Python talk to PostgreSQL.

# Without this, Python cannot understand PostgreSQL directly.


# What is SQLAlchemy?

# SQLAlchemy is a database toolkit and ORM (Object Relational Mapper).

# In simple terms, it helps you:

# Connect to databases easily

# Run SQL queries from Python

# Load database tables into Pandas

# Send Pandas DataFrames back to PostgreSQL

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: psycopg2-binary in c:\users\acer\appdata\roaming\python\python313\site-packages (2.9.11)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy in c:\programdata\anaconda3\lib\site-packages (2.0.43)
Requirement already satisfied: greenlet>=1 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy) (4.15.0)

In [21]:
from sqlalchemy import create_engine

#sqlalchemy = a library that helps Python talk to databases
#create_engine = a tool that creates the connection to PostgreSQL


# Step 1: Connect to PostgreSQL
# Replace placeholders with your actual details

username = "postgres"                          #default user
password = "Admin123"                          # the password you set during installation  
host = "localhost"                             # if running locally
port = "5432"                                  # default PostgreSQL port
database = "customer_behavior"                 # the database you created in pgAdmin

engine = create_engine(f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}")

# This line creates a connection engine that acts as a bridge between Python and PostgreSQL. 
# The connection string includes the database type (postgresql+psycopg2), username, password,
# host, port, and database name. This engine will be used later to send data from the Pandas DataFrame to PostgreSQL.


# Step 2: Load DataFrame into PostgreSQL
table_name = "customer"                                            # choose any table name or You are choosing a table name in your database.
df.to_sql(table_name, engine, if_exists="replace", index=False)

# This line uploads the Pandas DataFrame df into the PostgreSQL database as a table named customer. 
# The parameter if_exists="replace" means that if the table already exists, it will be replaced with the new data. 
# The parameter index=False ensures that the DataFrame index is not saved as a separate column in the database.

# df = your entire dataset (DataFrame)
# to_sql() = function that sends data to SQL database
# engine = your database connection
# if_exists="replace" = overwrite old table
# index=False = don’t save row numbers as a column


print(f"Data successfully loaded into table '{table_name}' in database '{database}'.")

#This is just a success message so you know everything worked.

Data successfully loaded into table 'customer' in database 'customer_behavior'.